Autodesk.Revit.DB.ServiceType
This enumeration is used for specifying the most predominant service for the building or space.
Remarks:
This enumerated list corresponds to the serviceType attribute in the gbXML (Green Building XML) schema
and is primarily used for energy analysis.